"""
печать сначала отрицательных,а затем положительных элементов последовательности
(из файла)
"""
def file(f) -> list:
    """ чтение данных из файла"""
    f = list(map(int, open("input.txt").read().split()))
    return f

def data_output(f: list) -> list:
    """ добавление элементов в список в нужном порядке"""
    if f[0] == "0":
        return a
    if f[0] < 0:
        a.append(f[0])
        data_output(f[1:])
    if f[0] > 0:
        data_output(f[1:])
        a.append(f[0])


def file_write(a: list):
    """ запись данных в файл"""
    fi = open("output.txt", "w")
    for i in a:
        fi.write(str(i) + " ")
    fi.close()


a = []
x = file("input.txt")
data_output(x)
file_write(a)

"""
_______________________________________
Входныеы данные   | Выходные данные____|    
__________________|____________________|         
2 5 -3 -9 9 0     | -3 -9 9 5 2        |    
__________________|____________________|    
87 -9 8 -1 3 -33 0|-9 -1 -33 3 8 87    |    
__________________|____________________|    
86 7 4 2 -3 0     |-3 2 4 7 86         |
__________________|____________________|

"""